---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.RebarCurvesData
source: html/2a465ace-b122-016a-eda8-e21e2462291d.htm
---
# RebarCurvesData Members

Adds a new bar to the new rebar geometry. This information is set to the rebar after the API execution is finished successfully.